ninety_nine_cats_2/app/controllers/sessions_controller.rb

    def create
        @user = User.find_by_credentials(params[:user][:user_name], params[:user][:password])
        if @user.save
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "1-O9IXW6yZ2LatKSXn0upA"], ["id", 2]]