ninety_nine_cats_2/app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["user_name", "alo"], ["password_digest", "$2a$12$39s11sONIxa9n5eZVqU.f.RLKL5RdR5ifH5cNwujZKgUZ2PpmkuvO"], ["session_token", "K26l6n1bRPyiJ52kXV7X0g"]]
---
    def create
        @user = User.new(user_params)
        if @user.save