ninety_nine_cats_2/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "1-O9IXW6yZ2LatKSXn0upA"], ["id", 2]]

    def self.find_by_credentials(user_name, password)
        @user = User.find_by(user_name: user_name)
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "alo"], ["LIMIT", 1]]